JayHeng/imxrt-flexspi-mem-fw/boards/mimxrt/mtu_fw/imxrt1189/port_flexspi_info.c
/*
 * Copyright 2022 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "mtu.h"
#include "fsl_common.h"
#include "fsl_iomuxc.h"
#include "pin_mux.h"
#include "fsl_rgpio.h"
#include "clock_config.h"
/*******************************************************************************
 * Definitions
 ******************************************************************************/

/////////////////////////////////////////////////////////////
enum _flexspi1_data_line_sel
{
    kFlexspi1_DataA_GPIO_B2_13_10      = 0x00,
    kFlexspi1_DataA_GPIO_B2_06_03      = 0x01,

    kFlexspi1_DataB_GPIO_SD_B2_11_08   = 0x10,
    kFlexspi1_DataB_GPIO_SD_B2_03_00   = 0x11,
    kFlexspi1_DataB_GPIO_B1_13_10      = 0x12,
    kFlexspi1_DataB_GPIO_B1_09_06      = 0x13,
};

enum _flexspi1_ss_b_sel
{
    kFlexspi1_Ss0A_GPIO_B2_09      = 0x00,
    kFlexspi1_Ss1A_GPIO_B2_01      = 0x01,
    kFlexspi1_Ss1A_GPIO_SD_B1_04   = 0x02,
    kFlexspi1_Ss1A_GPIO_SD_B1_02   = 0x03,

    kFlexspi1_Ss0B_GPIO_SD_B2_06   = 0x10,
    kFlexspi1_Ss0B_GPIO_SD_B1_05   = 0x11,
    kFlexspi1_Ss0B_GPIO_SD_B1_04   = 0x12,
    kFlexspi1_Ss0B_GPIO_B1_04      = 0x13,
    kFlexspi1_Ss1B_GPIO_SD_B2_04   = 0x14,
    kFlexspi1_Ss1B_GPIO_SD_B1_03   = 0x15,
    kFlexspi1_Ss1B_GPIO_B1_02      = 0x16,
};

enum _flexspi1_sclk_sel
{
    kFlexspi1_SclkA_GPIO_B2_08     = 0x00,

    kFlexspi1_SclkB_GPIO_SD_B2_07  = 0x10,
    kFlexspi1_SclkB_GPIO_B1_05     = 0x11,
    kFlexspi1_SclkB_GPIO_B2_02     = 0x12,
};

enum _flexspi1_dqs_sel
{
    kFlexspi1_DqsA_GPIO_B2_07      = 0x00,
    kFlexspi1_DqsA_GPIO_SD_B2_12   = 0x01,

    kFlexspi1_DqsB_GPIO_SD_B2_05   = 0x10,
    kFlexspi1_DqsB_GPIO_SD_B2_12   = 0x11,
    kFlexspi1_DqsB_GPIO_B1_03      = 0x12,
};

/////////////////////////////////////////////////////////////
enum _flexspi2_data_line_sel
{
    kFlexspi2_DataA_GPIO_EMC_B1_38_35       = 0x00,
    kFlexspi2_DataA_GPIO_AON_27_24          = 0x01,

    kFlexspi2_DataB_GPIO_EMC_B1_33_30       = 0x10,
    kFlexspi2_DataB_GPIO_AON_18_15          = 0x11,
    kFlexspi2_DataB_GPIO_EMC_B1_25_22       = 0x12,
};

enum _flexspi2_ss_b_sel
{
    kFlexspi2_Ss0A_GPIO_EMC_B1_39   = 0x00,
    kFlexspi2_Ss0A_GPIO_AON_22      = 0x01,
    kFlexspi2_Ss1A_GPIO_EMC_B1_26   = 0x02,
    kFlexspi2_Ss1A_GPIO_AON_20      = 0x03,
    kFlexspi2_Ss1A_GPIO_AON_19      = 0x04,

    kFlexspi2_Ss0B_GPIO_EMC_B1_28   = 0x10,
    kFlexspi2_Ss0B_GPIO_AON_21      = 0x11,
    kFlexspi2_Ss1B_GPIO_EMC_B1_27   = 0x12,
};

enum _flexspi2_sclk_sel
{
    kFlexspi2_SclkA_GPIO_EMC_B1_41  = 0x00,
    kFlexspi2_SclkA_GPIO_AON_23     = 0x01,

    kFlexspi2_SclkB_GPIO_EMC_B1_34  = 0x10,
    kFlexspi2_SclkB_GPIO_AON_19     = 0x11,
};

enum _flexspi2_dqs_sel
{
    kFlexspi2_DqsA_GPIO_EMC_B1_40   = 0x00,
    kFlexspi2_DqsA_GPIO_AON_21      = 0x01,
    kFlexspi2_DqsA_GPIO_AON_28      = 0x02,

    kFlexspi2_DqsB_GPIO_EMC_B1_29   = 0x10,
    kFlexspi2_DqsB_GPIO_AON_20      = 0x11,
    kFlexspi2_DqsB_GPIO_AON_28      = 0x12,
    kFlexspi2_DqsB_GPIO_EMC_B1_21   = 0x13,
};

#if MTU_USE_MEM_DC_MUX
#define MTU_USE_MEM_DC_MUX1_FSPI1_PORTA           \
    {                                             \
        RGPIO_PinWrite(RGPIO4, 23, 0);            \
    }

#define MTU_USE_MEM_DC_MUX2_FSPI1_PORTA           \
    {                                             \
        RGPIO_PinWrite(RGPIO4, 23, 0);            \
    }

#define MTU_USE_MEM_DC_MUX1_FSPI1_PORTB           \
    {                                             \
        RGPIO_PinWrite(RGPIO4, 23, 0);            \
    }

#define MTU_USE_MEM_DC_MUX2_FSPI1_PORTB           \
    {                                             \
        RGPIO_PinWrite(RGPIO4, 23, 1);            \
    }

#define MTU_USE_MEM_DC_MUX1_FSPI2_PORTA           \
    {                                             \
        RGPIO_PinWrite(RGPIO4, 22, 0);            \
    }

#define MTU_USE_MEM_DC_MUX2_FSPI2_PORTA           \
    {                                             \
        RGPIO_PinWrite(RGPIO4, 22, 1);            \
    }

#define MTU_USE_MEM_DC_MUX1_FSPI2_PORTB           \
    {                                             \
        RGPIO_PinWrite(RGPIO4, 22, 0);            \
    }

#define MTU_USE_MEM_DC_MUX2_FSPI2_PORTB           \
    {                                             \
        RGPIO_PinWrite(RGPIO4, 22, 1);            \
    }

#define MTU_USE_MEM_DC_MUX3_FSPI2_PORTB           \
    {                                             \
        RGPIO_PinWrite(RGPIO4, 22, 1);            \
    }
#else
#define MTU_USE_MEM_DC_MUX1_FSPI1_PORTA  {}
#define MTU_USE_MEM_DC_MUX2_FSPI1_PORTA  {}
#define MTU_USE_MEM_DC_MUX1_FSPI1_PORTB  {}
#define MTU_USE_MEM_DC_MUX2_FSPI1_PORTB  {}
#define MTU_USE_MEM_DC_MUX1_FSPI2_PORTA  {}
#define MTU_USE_MEM_DC_MUX2_FSPI2_PORTA  {}
#define MTU_USE_MEM_DC_MUX1_FSPI2_PORTB  {}
#define MTU_USE_MEM_DC_MUX2_FSPI2_PORTB  {}
#define MTU_USE_MEM_DC_MUX3_FSPI2_PORTB  {}
#endif

/*******************************************************************************
 * Prototypes
 ******************************************************************************/

   
/*******************************************************************************
 * Variables
 ******************************************************************************/

pin_info_t s_pinInfo[MTU_MAX_PINS];


/*******************************************************************************
 * Code
 ******************************************************************************/

void bsp_flexspi_pinmux_config(void *configPacket, bool isPintest)
{
    CLOCK_EnableClock(kCLOCK_Iomuxc1);
    CLOCK_EnableClock(kCLOCK_Iomuxc2);

#if MTU_USE_EVK_SOCKET
    rgpio_pin_config_t do1_config = {kRGPIO_DigitalOutput, 0};
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_04_GPIO4_IO04, 0U);
    RGPIO_PinInit(RGPIO4, 4, &do1_config);
    RGPIO_PinWrite(RGPIO4, 4, 1);
#elif MTU_USE_MEM_DC_MUX
    rgpio_pin_config_t do1_config = {kRGPIO_DigitalOutput, 0};
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_23_GPIO4_IO23, 0U);
    RGPIO_PinInit(RGPIO4, 23, &do1_config);
    RGPIO_PinWrite(RGPIO4, 23, 0);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_22_GPIO4_IO22, 0U);
    RGPIO_PinInit(RGPIO4, 22, &do1_config);
    RGPIO_PinWrite(RGPIO4, 22, 0);
#endif

