JayHeng/imxrt-flexspi-mem-fw/boards/mimxrt/mtu_fw/imxrt1189/port_flexspi_info.c
    if (isPintest)
    {
        pin_unittest_packet_t *packet = (pin_unittest_packet_t *)configPacket;
        rgpio_pin_config_t do_config = {kRGPIO_DigitalOutput, 0};
        memset(s_pinInfo, 0xFF, sizeof(s_pinInfo));
        if (packet->memConnection.instance == 1)
        {
            if (packet->unittestEn.option.B.dataLow4bit)
            {
                switch (packet->memConnection.dataLow4bit)
                {
                    case kFlexspi1_DataA_GPIO_B2_13_10:
                        MTU_USE_MEM_DC_MUX1_FSPI1_PORTA
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B2_13_GPIO6_IO27, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B2_12_GPIO6_IO26, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B2_11_GPIO6_IO25, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B2_10_GPIO6_IO24, 0U);
                        RGPIO_PinInit(RGPIO6, 27, &do_config);
                        RGPIO_PinInit(RGPIO6, 26, &do_config);
                        RGPIO_PinInit(RGPIO6, 25, &do_config);
                        RGPIO_PinInit(RGPIO6, 24, &do_config);
                        s_pinInfo[0].gpioGroup = 6;
                        s_pinInfo[0].gpioPin = 27;
                        s_pinInfo[1].gpioGroup = 6;
                        s_pinInfo[1].gpioPin = 26;
                        s_pinInfo[2].gpioGroup = 6;
                        s_pinInfo[2].gpioPin = 25;
                        s_pinInfo[3].gpioGroup = 6;
                        s_pinInfo[3].gpioPin = 24;
                        break;
                    case kFlexspi1_DataB_GPIO_SD_B2_11_08:
                        MTU_USE_MEM_DC_MUX1_FSPI1_PORTB
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_11_GPIO5_IO21, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_10_GPIO5_IO20, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_09_GPIO5_IO19, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_08_GPIO5_IO18, 0U);
                        RGPIO_PinInit(RGPIO5, 21, &do_config);
                        RGPIO_PinInit(RGPIO5, 20, &do_config);
                        RGPIO_PinInit(RGPIO5, 19, &do_config);
                        RGPIO_PinInit(RGPIO5, 18, &do_config);
                        s_pinInfo[0].gpioGroup = 5;
                        s_pinInfo[0].gpioPin = 21;
                        s_pinInfo[1].gpioGroup = 5;
                        s_pinInfo[1].gpioPin = 20;
                        s_pinInfo[2].gpioGroup = 5;
                        s_pinInfo[2].gpioPin = 19;
                        s_pinInfo[3].gpioGroup = 5;
                        s_pinInfo[3].gpioPin = 18;
                        break;
                    case kFlexspi1_DataB_GPIO_B1_13_10:
                        MTU_USE_MEM_DC_MUX2_FSPI1_PORTB
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B1_13_GPIO6_IO13, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B1_12_GPIO6_IO12, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B1_11_GPIO6_IO11, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B1_10_GPIO6_IO10, 0U);
                        RGPIO_PinInit(RGPIO6, 13, &do_config);
                        RGPIO_PinInit(RGPIO6, 12, &do_config);
                        RGPIO_PinInit(RGPIO6, 11, &do_config);
                        RGPIO_PinInit(RGPIO6, 10, &do_config);
                        s_pinInfo[0].gpioGroup = 6;
                        s_pinInfo[0].gpioPin = 13;
                        s_pinInfo[1].gpioGroup = 6;
                        s_pinInfo[1].gpioPin = 12;
                        s_pinInfo[2].gpioGroup = 6;
                        s_pinInfo[2].gpioPin = 11;
                        s_pinInfo[3].gpioGroup = 6;
                        s_pinInfo[3].gpioPin = 10;
                        break;
                    default:
                        break;
                }
            }
            if (packet->unittestEn.option.B.ss_b)
            {
                switch (packet->memConnection.ss_b)
                {
                    case kFlexspi1_Ss0A_GPIO_B2_09:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B2_09_GPIO6_IO23, 0U);
                        RGPIO_PinInit(RGPIO6, 23, &do_config);
                        s_pinInfo[4].gpioGroup = 6;
                        s_pinInfo[4].gpioPin = 23;
                        break;
                    case kFlexspi1_Ss1A_GPIO_B2_01:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B2_01_GPIO6_IO15, 0U);
                        RGPIO_PinInit(RGPIO6, 15, &do_config);
                        s_pinInfo[4].gpioGroup = 6;
                        s_pinInfo[4].gpioPin = 15;
                        break;
                    case kFlexspi1_Ss1A_GPIO_SD_B1_04:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_04_GPIO5_IO08, 0U);
                        RGPIO_PinInit(RGPIO5, 8, &do_config);
                        s_pinInfo[4].gpioGroup = 5;
                        s_pinInfo[4].gpioPin = 8;
                        break;
                    case kFlexspi1_Ss1A_GPIO_SD_B1_02:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_02_GPIO5_IO06, 0U);
                        RGPIO_PinInit(RGPIO5, 6, &do_config);
                        s_pinInfo[4].gpioGroup = 5;
                        s_pinInfo[4].gpioPin = 6;
                        break;
                    case kFlexspi1_Ss0B_GPIO_SD_B2_06:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_06_GPIO5_IO16, 0U);
                        RGPIO_PinInit(RGPIO5, 16, &do_config);
                        s_pinInfo[4].gpioGroup = 5;
                        s_pinInfo[4].gpioPin = 16;
                        break;
                    case kFlexspi1_Ss0B_GPIO_SD_B1_05:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_05_GPIO5_IO09, 0U);
                        RGPIO_PinInit(RGPIO5, 9, &do_config);
                        s_pinInfo[4].gpioGroup = 5;
                        s_pinInfo[4].gpioPin = 9;
                        break;
                    case kFlexspi1_Ss0B_GPIO_SD_B1_04:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_04_GPIO5_IO08, 0U);
                        RGPIO_PinInit(RGPIO5, 8, &do_config);
                        s_pinInfo[4].gpioGroup = 5;
                        s_pinInfo[4].gpioPin = 8;
                        break;
                    case kFlexspi1_Ss0B_GPIO_B1_04:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B1_04_GPIO6_IO04, 0U);
                        RGPIO_PinInit(RGPIO6, 4, &do_config);
                        s_pinInfo[4].gpioGroup = 6;
                        s_pinInfo[4].gpioPin = 4;
                        break;
                    case kFlexspi1_Ss1B_GPIO_SD_B2_04:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_04_GPIO5_IO14, 0U);
                        RGPIO_PinInit(RGPIO5, 14, &do_config);
                        s_pinInfo[4].gpioGroup = 5;
                        s_pinInfo[4].gpioPin = 14;
                        break;
                    case kFlexspi1_Ss1B_GPIO_SD_B1_03:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_03_GPIO5_IO07, 0U);
                        RGPIO_PinInit(RGPIO5, 7, &do_config);
                        s_pinInfo[4].gpioGroup = 5;
                        s_pinInfo[4].gpioPin = 7;
                        break;
                    case kFlexspi1_Ss1B_GPIO_B1_02:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B1_02_GPIO6_IO02, 0U);
                        RGPIO_PinInit(RGPIO6, 2, &do_config);
                        s_pinInfo[4].gpioGroup = 6;
                        s_pinInfo[4].gpioPin = 2;
                        break;
                    default:
                        break;
                }
            }
            if (packet->unittestEn.option.B.sclk)
            {
                switch (packet->memConnection.sclk)
                {
                    case kFlexspi1_SclkA_GPIO_B2_08:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B2_08_GPIO6_IO22, 0U);
                        RGPIO_PinInit(RGPIO6, 22, &do_config);
                        s_pinInfo[5].gpioGroup = 6;
                        s_pinInfo[5].gpioPin = 22;
                        break;
                    case kFlexspi1_SclkB_GPIO_SD_B2_07:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_07_GPIO5_IO17, 0U);
                        RGPIO_PinInit(RGPIO5, 17, &do_config);
                        s_pinInfo[5].gpioGroup = 5;
                        s_pinInfo[5].gpioPin = 17;
                        break;
                    case kFlexspi1_SclkB_GPIO_B1_05:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B1_05_GPIO6_IO05, 0U);
                        RGPIO_PinInit(RGPIO6, 5, &do_config);
                        s_pinInfo[5].gpioGroup = 6;
                        s_pinInfo[5].gpioPin = 5;
                        break;
                    case kFlexspi1_SclkB_GPIO_B2_02:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B2_02_GPIO6_IO16, 0U);
                        RGPIO_PinInit(RGPIO6, 16, &do_config);
                        s_pinInfo[5].gpioGroup = 6;
                        s_pinInfo[5].gpioPin = 16;
                        break;
                    default:
                        break;
                }
            }
            if (packet->unittestEn.option.B.dqs0)
            {
                switch (packet->memConnection.dqs0)
                {
                    case kFlexspi1_DqsA_GPIO_B2_07:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B2_07_GPIO6_IO21, 0U);
                        RGPIO_PinInit(RGPIO6, 21, &do_config);
                        s_pinInfo[6].gpioGroup = 6;
                        s_pinInfo[6].gpioPin = 21;
                        break;
                    case kFlexspi1_DqsA_GPIO_SD_B2_12:
                    case kFlexspi1_DqsB_GPIO_SD_B2_12:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_12_DUMMY_GPIO5_IO22, 0U);
                        RGPIO_PinInit(RGPIO5, 22, &do_config);
                        s_pinInfo[6].gpioGroup = 5;
                        s_pinInfo[6].gpioPin = 22;
                        break;
                    case kFlexspi1_DqsB_GPIO_SD_B2_05:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_05_GPIO5_IO15, 0U);
                        RGPIO_PinInit(RGPIO5, 15, &do_config);
                        s_pinInfo[6].gpioGroup = 5;
                        s_pinInfo[6].gpioPin = 15;
                        break;
                    case kFlexspi1_DqsB_GPIO_B1_03:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B1_03_GPIO6_IO03, 0U);
                        RGPIO_PinInit(RGPIO6, 3, &do_config);
                        s_pinInfo[6].gpioGroup = 6;
                        s_pinInfo[6].gpioPin = 3;
                        break;
                    default:
                        break;
                }
            }
            if (packet->unittestEn.option.B.dataHigh4bit)
            {
                switch (packet->memConnection.dataHigh4bit)
                {
                    case kFlexspi1_DataA_GPIO_B2_06_03:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B2_06_GPIO6_IO20, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B2_05_GPIO6_IO19, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B2_04_GPIO6_IO18, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B2_03_GPIO6_IO17, 0U);
                        RGPIO_PinInit(RGPIO6, 20, &do_config);
                        RGPIO_PinInit(RGPIO6, 19, &do_config);
                        RGPIO_PinInit(RGPIO6, 18, &do_config);
                        RGPIO_PinInit(RGPIO6, 17, &do_config);
                        s_pinInfo[7].gpioGroup = 6;
                        s_pinInfo[7].gpioPin = 20;
                        s_pinInfo[8].gpioGroup = 6;
                        s_pinInfo[8].gpioPin = 19;
                        s_pinInfo[9].gpioGroup = 6;
                        s_pinInfo[9].gpioPin = 18;
                        s_pinInfo[10].gpioGroup = 6;
                        s_pinInfo[10].gpioPin = 17;
                        break;
                    case kFlexspi1_DataB_GPIO_SD_B2_03_00:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_03_GPIO5_IO13, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_02_GPIO5_IO12, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_01_GPIO5_IO11, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_00_GPIO5_IO10, 0U);
                        RGPIO_PinInit(RGPIO5, 13, &do_config);
                        RGPIO_PinInit(RGPIO5, 12, &do_config);
                        RGPIO_PinInit(RGPIO5, 11, &do_config);
                        RGPIO_PinInit(RGPIO5, 10, &do_config);
                        s_pinInfo[7].gpioGroup = 5;
                        s_pinInfo[7].gpioPin = 13;
                        s_pinInfo[8].gpioGroup = 5;
                        s_pinInfo[8].gpioPin = 12;
                        s_pinInfo[9].gpioGroup = 5;
                        s_pinInfo[9].gpioPin = 11;
                        s_pinInfo[10].gpioGroup = 5;
                        s_pinInfo[10].gpioPin = 10;
                        break;
                    case kFlexspi1_DataB_GPIO_B1_09_06:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B1_09_GPIO6_IO09, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B1_08_GPIO6_IO08, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B1_07_GPIO6_IO07, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B1_06_GPIO6_IO06, 0U);
                        RGPIO_PinInit(RGPIO6, 9, &do_config);
                        RGPIO_PinInit(RGPIO6, 8, &do_config);
                        RGPIO_PinInit(RGPIO6, 7, &do_config);
                        RGPIO_PinInit(RGPIO6, 6, &do_config);
                        s_pinInfo[7].gpioGroup = 6;
                        s_pinInfo[7].gpioPin = 9;
                        s_pinInfo[8].gpioGroup = 6;
                        s_pinInfo[8].gpioPin = 8;
                        s_pinInfo[9].gpioGroup = 6;
                        s_pinInfo[9].gpioPin = 7;
                        s_pinInfo[10].gpioGroup = 6;
                        s_pinInfo[10].gpioPin = 6;
                        break;
                    default:
                        break;
                }
            }
            if (packet->unittestEn.option.B.dataTop8bit)
            {
            }
            if (packet->unittestEn.option.B.sclk_n)
            {
                switch (packet->memConnection.sclk_n)
                {
                    case kFlexspi1_SclkB_GPIO_B2_02:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B2_02_GPIO6_IO16, 0U);
                        RGPIO_PinInit(RGPIO6, 16, &do_config);
                        s_pinInfo[19].gpioGroup = 6;
                        s_pinInfo[19].gpioPin = 16;
                        break;
                    default:
                        break;
                }
            }
            if (packet->unittestEn.option.B.dqs1)
            {
                switch (packet->memConnection.dqs1)
                {
                    case kFlexspi1_DqsA_GPIO_SD_B2_12:
                    case kFlexspi1_DqsB_GPIO_SD_B2_12:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_12_DUMMY_GPIO5_IO22, 0U);
                        RGPIO_PinInit(RGPIO5, 22, &do_config);
                        s_pinInfo[20].gpioGroup = 5;
                        s_pinInfo[20].gpioPin = 22;
                        break;
                    default:
                        break;
                }
            }
            if (packet->unittestEn.option.B.rst_b)
            {
            }
        }
        else if (packet->memConnection.instance == 2)
        {
            if (packet->unittestEn.option.B.dataLow4bit)
            {
                switch (packet->memConnection.dataLow4bit)
                {
                    case kFlexspi2_DataA_GPIO_EMC_B1_38_35:
                        MTU_USE_MEM_DC_MUX1_FSPI2_PORTA
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_38_GPIO3_IO06, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_37_GPIO3_IO05, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_36_GPIO3_IO04, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_35_GPIO3_IO03, 0U);
                        RGPIO_PinInit(RGPIO3, 6, &do_config);
                        RGPIO_PinInit(RGPIO3, 5, &do_config);
                        RGPIO_PinInit(RGPIO3, 4, &do_config);
                        RGPIO_PinInit(RGPIO3, 3, &do_config);
                        s_pinInfo[0].gpioGroup = 3;
                        s_pinInfo[0].gpioPin = 6;
                        s_pinInfo[1].gpioGroup = 3;
                        s_pinInfo[1].gpioPin = 5;
                        s_pinInfo[2].gpioGroup = 3;
                        s_pinInfo[2].gpioPin = 4;
                        s_pinInfo[3].gpioGroup = 3;
                        s_pinInfo[3].gpioPin = 3;
                        break;
                    case kFlexspi2_DataA_GPIO_AON_27_24:
                        MTU_USE_MEM_DC_MUX2_FSPI2_PORTA
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AON_27_GPIO1_IO27, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AON_26_GPIO1_IO26, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AON_25_GPIO1_IO25, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AON_24_GPIO1_IO24, 0U);
                        RGPIO_PinInit(RGPIO1, 27, &do_config);
                        RGPIO_PinInit(RGPIO1, 26, &do_config);
                        RGPIO_PinInit(RGPIO1, 25, &do_config);
                        RGPIO_PinInit(RGPIO1, 24, &do_config);
                        s_pinInfo[0].gpioGroup = 1;
                        s_pinInfo[0].gpioPin = 27;
                        s_pinInfo[1].gpioGroup = 1;
                        s_pinInfo[1].gpioPin = 26;
                        s_pinInfo[2].gpioGroup = 1;
                        s_pinInfo[2].gpioPin = 25;
                        s_pinInfo[3].gpioGroup = 1;
                        s_pinInfo[3].gpioPin = 24;
                        break;
                    case kFlexspi2_DataB_GPIO_EMC_B1_33_30:
                        MTU_USE_MEM_DC_MUX1_FSPI2_PORTA
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_33_GPIO3_IO01, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_32_GPIO3_IO00, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_31_GPIO2_IO31, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_30_GPIO2_IO30, 0U);
                        RGPIO_PinInit(RGPIO3, 1, &do_config);
                        RGPIO_PinInit(RGPIO3, 0, &do_config);
                        RGPIO_PinInit(RGPIO2, 31, &do_config);
                        RGPIO_PinInit(RGPIO2, 30, &do_config);
                        s_pinInfo[0].gpioGroup = 3;
                        s_pinInfo[0].gpioPin = 1;
                        s_pinInfo[1].gpioGroup = 3;
                        s_pinInfo[1].gpioPin = 0;
                        s_pinInfo[2].gpioGroup = 2;
                        s_pinInfo[2].gpioPin = 31;
                        s_pinInfo[3].gpioGroup = 2;
                        s_pinInfo[3].gpioPin = 30;
                        break;
                    case kFlexspi2_DataB_GPIO_AON_18_15:
                        MTU_USE_MEM_DC_MUX2_FSPI2_PORTA
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AON_18_GPIO1_IO18, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AON_17_GPIO1_IO17, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AON_16_GPIO1_IO16, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AON_15_GPIO1_IO15, 0U);
                        RGPIO_PinInit(RGPIO1, 18, &do_config);
                        RGPIO_PinInit(RGPIO1, 17, &do_config);
                        RGPIO_PinInit(RGPIO1, 16, &do_config);
                        RGPIO_PinInit(RGPIO1, 15, &do_config);
                        s_pinInfo[0].gpioGroup = 1;
                        s_pinInfo[0].gpioPin = 18;
                        s_pinInfo[1].gpioGroup = 1;
                        s_pinInfo[1].gpioPin = 17;
                        s_pinInfo[2].gpioGroup = 1;
                        s_pinInfo[2].gpioPin = 16;
                        s_pinInfo[3].gpioGroup = 1;
                        s_pinInfo[3].gpioPin = 15;
                        break;
                    case kFlexspi2_DataB_GPIO_EMC_B1_25_22:
                        MTU_USE_MEM_DC_MUX3_FSPI2_PORTB
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_25_GPIO2_IO25, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_24_GPIO2_IO24, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_23_GPIO2_IO23, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_22_GPIO2_IO22, 0U);
                        RGPIO_PinInit(RGPIO2, 25, &do_config);
                        RGPIO_PinInit(RGPIO2, 24, &do_config);
                        RGPIO_PinInit(RGPIO2, 23, &do_config);
                        RGPIO_PinInit(RGPIO2, 22, &do_config);
                        s_pinInfo[0].gpioGroup = 2;
                        s_pinInfo[0].gpioPin = 25;
                        s_pinInfo[1].gpioGroup = 2;
                        s_pinInfo[1].gpioPin = 24;
                        s_pinInfo[2].gpioGroup = 2;
                        s_pinInfo[2].gpioPin = 23;
                        s_pinInfo[3].gpioGroup = 2;
                        s_pinInfo[3].gpioPin = 22;
                        break;
                    default:
                        break;
                }
            }
            if (packet->unittestEn.option.B.ss_b)
            {
                switch (packet->memConnection.ss_b)
                {
                    case kFlexspi2_Ss0A_GPIO_EMC_B1_39:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_39_GPIO3_IO07, 0U);
                        RGPIO_PinInit(RGPIO3, 7, &do_config);
                        s_pinInfo[4].gpioGroup = 3;
                        s_pinInfo[4].gpioPin = 7;
                        break;
                    case kFlexspi2_Ss0A_GPIO_AON_22:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AON_22_GPIO1_IO22, 0U);
                        RGPIO_PinInit(RGPIO1, 22, &do_config);
                        s_pinInfo[4].gpioGroup = 1;
                        s_pinInfo[4].gpioPin = 22;
                        break;
                    case kFlexspi2_Ss1A_GPIO_EMC_B1_26:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_26_GPIO2_IO26, 0U);
                        RGPIO_PinInit(RGPIO2, 26, &do_config);
                        s_pinInfo[4].gpioGroup = 2;
                        s_pinInfo[4].gpioPin = 26;
                        break;
                    case kFlexspi2_Ss1A_GPIO_AON_20:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AON_20_GPIO1_IO20, 0U);
                        RGPIO_PinInit(RGPIO1, 20, &do_config);
                        s_pinInfo[4].gpioGroup = 1;
                        s_pinInfo[4].gpioPin = 20;
                        break;
                    case kFlexspi2_Ss1A_GPIO_AON_19:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AON_19_GPIO1_IO19, 0U);
                        RGPIO_PinInit(RGPIO1, 19, &do_config);
                        s_pinInfo[4].gpioGroup = 1;
                        s_pinInfo[4].gpioPin = 19;
                        break;
                    case kFlexspi2_Ss0B_GPIO_EMC_B1_28:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_28_GPIO2_IO28, 0U);
                        RGPIO_PinInit(RGPIO2, 28, &do_config);
                        s_pinInfo[4].gpioGroup = 2;
                        s_pinInfo[4].gpioPin = 28;
                        break;
                    default:
                        break;
                }
            }
            if (packet->unittestEn.option.B.sclk)
            {
                switch (packet->memConnection.sclk)
                {
                    case kFlexspi2_SclkA_GPIO_EMC_B1_41:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_41_GPIO3_IO09, 0U);
