JayHeng/imxrt-flexspi-mem-fw/boards/mimxrt/mtu_fw/imxrt1189/port_flexspi_info.c
                        RGPIO_PinInit(RGPIO3, 9, &do_config);
                        s_pinInfo[5].gpioGroup = 3;
                        s_pinInfo[5].gpioPin = 9;
                        break;
                    case kFlexspi2_SclkA_GPIO_AON_23:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AON_23_GPIO1_IO23, 0U);
                        RGPIO_PinInit(RGPIO1, 23, &do_config);
                        s_pinInfo[5].gpioGroup = 1;
                        s_pinInfo[5].gpioPin = 23;
                        break;
                    case kFlexspi2_SclkB_GPIO_EMC_B1_34:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_34_GPIO3_IO02, 0U);
                        RGPIO_PinInit(RGPIO3, 2, &do_config);
                        s_pinInfo[5].gpioGroup = 3;
                        s_pinInfo[5].gpioPin = 2;
                        break;
                    case kFlexspi2_SclkB_GPIO_AON_19:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AON_19_GPIO1_IO19, 0U);
                        RGPIO_PinInit(RGPIO1, 19, &do_config);
                        s_pinInfo[5].gpioGroup = 1;
                        s_pinInfo[5].gpioPin = 19;
                        break;
                    default:
                        break;
                }
            }
            if (packet->unittestEn.option.B.dqs0)
            {
                switch (packet->memConnection.dqs0)
                {
                    case kFlexspi2_DqsA_GPIO_EMC_B1_40:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_40_GPIO3_IO08, 0U);
                        RGPIO_PinInit(RGPIO3, 8, &do_config);
                        s_pinInfo[6].gpioGroup = 3;
                        s_pinInfo[6].gpioPin = 8;
                        break;
                    case kFlexspi2_DqsA_GPIO_AON_21:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AON_21_GPIO1_IO21, 0U);
                        RGPIO_PinInit(RGPIO1, 21, &do_config);
                        s_pinInfo[6].gpioGroup = 1;
                        s_pinInfo[6].gpioPin = 21;
                        break;
                    case kFlexspi2_DqsA_GPIO_AON_28:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AON_28_DUMMY_GPIO1_IO28, 0U);
                        RGPIO_PinInit(RGPIO1, 28, &do_config);
                        s_pinInfo[6].gpioGroup = 1;
                        s_pinInfo[6].gpioPin = 28;
                        break;
                    case kFlexspi2_DqsB_GPIO_EMC_B1_29:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_29_GPIO2_IO29, 0U);
                        RGPIO_PinInit(RGPIO2, 29, &do_config);
                        s_pinInfo[6].gpioGroup = 2;
                        s_pinInfo[6].gpioPin = 29;
                        break;
                    case kFlexspi2_DqsB_GPIO_AON_20:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AON_20_GPIO1_IO20, 0U);
                        RGPIO_PinInit(RGPIO1, 20, &do_config);
                        s_pinInfo[6].gpioGroup = 1;
                        s_pinInfo[6].gpioPin = 20;
                        break;
                    case kFlexspi2_DqsB_GPIO_AON_28:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AON_28_DUMMY_GPIO1_IO28, 0U);
                        RGPIO_PinInit(RGPIO1, 28, &do_config);
                        s_pinInfo[6].gpioGroup = 1;
                        s_pinInfo[6].gpioPin = 28;
                        break;
                    case kFlexspi2_DqsB_GPIO_EMC_B1_21:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_21_GPIO2_IO21, 0U);
                        RGPIO_PinInit(RGPIO2, 21, &do_config);
                        s_pinInfo[6].gpioGroup = 2;
                        s_pinInfo[6].gpioPin = 21;
                        break;
                    default:
                        break;
                }
            }
            if (packet->unittestEn.option.B.dataHigh4bit)
            {
                switch (packet->memConnection.dataHigh4bit)
                {
                    case kFlexspi2_DataB_GPIO_EMC_B1_33_30:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_33_GPIO3_IO01, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_32_GPIO3_IO00, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_31_GPIO2_IO31, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_30_GPIO2_IO30, 0U);
                        RGPIO_PinInit(RGPIO3, 1, &do_config);
                        RGPIO_PinInit(RGPIO3, 0, &do_config);
                        RGPIO_PinInit(RGPIO2, 31, &do_config);
                        RGPIO_PinInit(RGPIO2, 30, &do_config);
                        s_pinInfo[7].gpioGroup = 3;
                        s_pinInfo[7].gpioPin = 1;
                        s_pinInfo[8].gpioGroup = 3;
                        s_pinInfo[8].gpioPin = 0;
                        s_pinInfo[9].gpioGroup = 2;
                        s_pinInfo[9].gpioPin = 31;
                        s_pinInfo[10].gpioGroup = 2;
                        s_pinInfo[10].gpioPin = 30;
                        break;
                    case kFlexspi2_DataB_GPIO_AON_18_15:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AON_18_GPIO1_IO18, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AON_17_GPIO1_IO17, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AON_16_GPIO1_IO16, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AON_15_GPIO1_IO15, 0U);
                        RGPIO_PinInit(RGPIO1, 18, &do_config);
                        RGPIO_PinInit(RGPIO1, 17, &do_config);
                        RGPIO_PinInit(RGPIO1, 16, &do_config);
                        RGPIO_PinInit(RGPIO1, 15, &do_config);
                        s_pinInfo[7].gpioGroup = 1;
                        s_pinInfo[7].gpioPin = 18;
                        s_pinInfo[8].gpioGroup = 1;
                        s_pinInfo[8].gpioPin = 17;
                        s_pinInfo[9].gpioGroup = 1;
                        s_pinInfo[9].gpioPin = 16;
                        s_pinInfo[10].gpioGroup = 1;
                        s_pinInfo[10].gpioPin = 15;
                        break;
                    case kFlexspi2_DataB_GPIO_EMC_B1_25_22:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_25_GPIO2_IO25, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_24_GPIO2_IO24, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_23_GPIO2_IO23, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_22_GPIO2_IO22, 0U);
                        RGPIO_PinInit(RGPIO2, 25, &do_config);
                        RGPIO_PinInit(RGPIO2, 24, &do_config);
                        RGPIO_PinInit(RGPIO2, 23, &do_config);
                        RGPIO_PinInit(RGPIO2, 22, &do_config);
                        s_pinInfo[7].gpioGroup = 2;
                        s_pinInfo[7].gpioPin = 25;
                        s_pinInfo[8].gpioGroup = 2;
                        s_pinInfo[8].gpioPin = 24;
                        s_pinInfo[9].gpioGroup = 2;
                        s_pinInfo[9].gpioPin = 23;
                        s_pinInfo[10].gpioGroup = 2;
                        s_pinInfo[10].gpioPin = 22;
                        break;
                    default:
                        break;
                }
            }
            if (packet->unittestEn.option.B.dataTop8bit)
            {
            }
            if (packet->unittestEn.option.B.sclk_n)
            {
                switch (packet->memConnection.sclk_n)
                {
                    case kFlexspi2_SclkB_GPIO_EMC_B1_34:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_34_GPIO3_IO02, 0U);
                        RGPIO_PinInit(RGPIO3, 2, &do_config);
                        s_pinInfo[19].gpioGroup = 3;
                        s_pinInfo[19].gpioPin = 2;
                        break;
                    case kFlexspi2_SclkB_GPIO_AON_19:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AON_19_GPIO1_IO19, 0U);
                        RGPIO_PinInit(RGPIO1, 19, &do_config);
                        s_pinInfo[19].gpioGroup = 1;
                        s_pinInfo[19].gpioPin = 19;
                        break;
                    default:
                        break;
                }
            }
            if (packet->unittestEn.option.B.dqs1)
            {
                switch (packet->memConnection.dqs1)
                {
                    case kFlexspi2_DqsB_GPIO_EMC_B1_29:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_29_GPIO2_IO29, 0U);
                        RGPIO_PinInit(RGPIO2, 29, &do_config);
                        s_pinInfo[20].gpioGroup = 2;
                        s_pinInfo[20].gpioPin = 29;
                        break;
                    case kFlexspi2_DqsB_GPIO_AON_20:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AON_20_GPIO1_IO20, 0U);
                        RGPIO_PinInit(RGPIO1, 20, &do_config);
                        s_pinInfo[20].gpioGroup = 1;
                        s_pinInfo[20].gpioPin = 20;
                        break;
                    case kFlexspi2_DqsB_GPIO_AON_28:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AON_28_DUMMY_GPIO1_IO28, 0U);
                        RGPIO_PinInit(RGPIO1, 28, &do_config);
                        s_pinInfo[20].gpioGroup = 1;
                        s_pinInfo[20].gpioPin = 28;
                        break;
                    case kFlexspi2_DqsB_GPIO_EMC_B1_21:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_21_GPIO2_IO21, 0U);
                        RGPIO_PinInit(RGPIO2, 21, &do_config);
                        s_pinInfo[20].gpioGroup = 2;
                        s_pinInfo[20].gpioPin = 21;
                        break;
                    default:
                        break;
                }
            }
            if (packet->unittestEn.option.B.rst_b)
            {
            }
        }
    }
    else
    {
        config_system_packet_t *packet = (config_system_packet_t *)configPacket;
        if (packet->memConnection.instance == 1)
        {
            switch (packet->memConnection.dataLow4bit)
            {
                case kFlexspi1_DataA_GPIO_B2_13_10:
                    MTU_USE_MEM_DC_MUX1_FSPI1_PORTA
                    IOMUXC_SetPinMux(IOMUXC_GPIO_B2_10_FLEXSPI1_BUS2BIT_A_DATA00, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_B2_11_FLEXSPI1_BUS2BIT_A_DATA01, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_B2_12_FLEXSPI1_BUS2BIT_A_DATA02, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_B2_13_FLEXSPI1_BUS2BIT_A_DATA03, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_B2_10_FLEXSPI1_BUS2BIT_A_DATA00, 0x0AU);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_B2_11_FLEXSPI1_BUS2BIT_A_DATA01, 0x0AU);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_B2_12_FLEXSPI1_BUS2BIT_A_DATA02, 0x0AU);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_B2_13_FLEXSPI1_BUS2BIT_A_DATA03, 0x0AU);
                    break;
                case kFlexspi1_DataB_GPIO_SD_B2_11_08:
                    MTU_USE_MEM_DC_MUX1_FSPI1_PORTB
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_08_FLEXSPI1_BUS2BIT_B_DATA00, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_09_FLEXSPI1_BUS2BIT_B_DATA01, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_10_FLEXSPI1_BUS2BIT_B_DATA02, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_11_FLEXSPI1_BUS2BIT_B_DATA03, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_08_FLEXSPI1_BUS2BIT_B_DATA00, 0x0AU);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_09_FLEXSPI1_BUS2BIT_B_DATA01, 0x0AU);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_10_FLEXSPI1_BUS2BIT_B_DATA02, 0x0AU);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_11_FLEXSPI1_BUS2BIT_B_DATA03, 0x0AU);
                    break;
                case kFlexspi1_DataB_GPIO_B1_13_10:
                    MTU_USE_MEM_DC_MUX2_FSPI1_PORTB
                    IOMUXC_SetPinMux(IOMUXC_GPIO_B1_13_FLEXSPI1_BUS2BIT_B_DATA00, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_B1_12_FLEXSPI1_BUS2BIT_B_DATA01, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_B1_11_FLEXSPI1_BUS2BIT_B_DATA02, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_B1_10_FLEXSPI1_BUS2BIT_B_DATA03, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_B1_13_FLEXSPI1_BUS2BIT_B_DATA00, 0x0AU);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_B1_12_FLEXSPI1_BUS2BIT_B_DATA01, 0x0AU);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_B1_11_FLEXSPI1_BUS2BIT_B_DATA02, 0x0AU);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_B1_10_FLEXSPI1_BUS2BIT_B_DATA03, 0x0AU);
                    break;
                default:
                    break;
            }
            switch (packet->memConnection.ss_b)
            {
                case kFlexspi1_Ss0A_GPIO_B2_09:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_B2_09_FLEXSPI1_BUS2BIT_A_SS0_B, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_B2_09_FLEXSPI1_BUS2BIT_A_SS0_B, 0x0AU);
                    break;
                case kFlexspi1_Ss1A_GPIO_B2_01:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_B2_01_FLEXSPI1_BUS2BIT_A_SS1_B, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_B2_01_FLEXSPI1_BUS2BIT_A_SS1_B, 0x0AU);
                    break;
                case kFlexspi1_Ss1A_GPIO_SD_B1_04:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_04_FLEXSPI1_BUS2BIT_A_SS1_B, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_04_FLEXSPI1_BUS2BIT_A_SS1_B, 0x0AU);
                    break;
                case kFlexspi1_Ss1A_GPIO_SD_B1_02:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_02_FLEXSPI1_BUS2BIT_A_SS1_B, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_02_FLEXSPI1_BUS2BIT_A_SS1_B, 0x0AU);
                    break;
                case kFlexspi1_Ss0B_GPIO_SD_B2_06:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_06_FLEXSPI1_BUS2BIT_B_SS0_B, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_06_FLEXSPI1_BUS2BIT_B_SS0_B, 0x0AU);
                    break;
                case kFlexspi1_Ss0B_GPIO_SD_B1_05:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_05_FLEXSPI1_BUS2BIT_B_SS0_B, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_05_FLEXSPI1_BUS2BIT_B_SS0_B, 0x0AU);
                    break;
                case kFlexspi1_Ss0B_GPIO_SD_B1_04:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_04_FLEXSPI1_BUS2BIT_B_SS0_B, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_04_FLEXSPI1_BUS2BIT_B_SS0_B, 0x0AU);
                    break;
                case kFlexspi1_Ss0B_GPIO_B1_04:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_B1_04_FLEXSPI1_BUS2BIT_B_SS0_B, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_B1_04_FLEXSPI1_BUS2BIT_B_SS0_B, 0x0AU);
                    break;
                case kFlexspi1_Ss1B_GPIO_SD_B2_04:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_04_FLEXSPI1_BUS2BIT_B_SS1_B, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_04_FLEXSPI1_BUS2BIT_B_SS1_B, 0x0AU);
                    break;
                case kFlexspi1_Ss1B_GPIO_SD_B1_03:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_03_FLEXSPI1_BUS2BIT_B_SS1_B, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_03_FLEXSPI1_BUS2BIT_B_SS1_B, 0x0AU);
                    break;
                case kFlexspi1_Ss1B_GPIO_B1_02:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_B1_02_FLEXSPI1_BUS2BIT_B_SS1_B, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_B1_02_FLEXSPI1_BUS2BIT_B_SS1_B, 0x0AU);
                    break;
                default:
                    break;
            }
            switch (packet->memConnection.sclk)
            {
                case kFlexspi1_SclkA_GPIO_B2_08:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_B2_08_FLEXSPI1_BUS2BIT_A_SCLK, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_B2_08_FLEXSPI1_BUS2BIT_A_SCLK, 0x0AU);
                    break;
                case kFlexspi1_SclkB_GPIO_SD_B2_07:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_07_FLEXSPI1_BUS2BIT_B_SCLK, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_07_FLEXSPI1_BUS2BIT_B_SCLK, 0x0AU);
                    break;
                case kFlexspi1_SclkB_GPIO_B1_05:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_B1_05_FLEXSPI1_BUS2BIT_B_SCLK, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_B1_05_FLEXSPI1_BUS2BIT_B_SCLK, 0x0AU);
                    break;
                case kFlexspi1_SclkB_GPIO_B2_02:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_B2_02_FLEXSPI1_BUS2BIT_B_SCLK, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_B2_02_FLEXSPI1_BUS2BIT_B_SCLK, 0x0AU);
                    break;
                default:
                    break;
            }
            switch (packet->memConnection.dqs0)
            {
                case kFlexspi1_DqsA_GPIO_B2_07:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_B2_07_FLEXSPI1_BUS2BIT_A_DQS, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_B2_07_FLEXSPI1_BUS2BIT_A_DQS, 0x0AU);
                    break;
                case kFlexspi1_DqsA_GPIO_SD_B2_12:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_12_DUMMY_FLEXSPI1_BUS2BIT_A_DQS, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_12_DUMMY_FLEXSPI1_BUS2BIT_A_DQS, 0x0AU);
                    break;
                case kFlexspi1_DqsB_GPIO_SD_B2_05:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_05_FLEXSPI1_BUS2BIT_B_DQS, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_05_FLEXSPI1_BUS2BIT_B_DQS, 0x0AU);
                    break;
                case kFlexspi1_DqsB_GPIO_SD_B2_12:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_12_DUMMY_FLEXSPI1_BUS2BIT_B_DQS, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_12_DUMMY_FLEXSPI1_BUS2BIT_B_DQS, 0x0AU);
                    break;
                case kFlexspi1_DqsB_GPIO_B1_03:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_B1_03_FLEXSPI1_BUS2BIT_B_DQS, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_B1_03_FLEXSPI1_BUS2BIT_B_DQS, 0x0AU);
                    break;
                default:
                    break;
            }
            switch (packet->memConnection.dataHigh4bit)
            {
                case kFlexspi1_DataA_GPIO_B2_06_03:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_B2_06_FLEXSPI1_BUS2BIT_A_DATA07, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_B2_05_FLEXSPI1_BUS2BIT_A_DATA06, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_B2_04_FLEXSPI1_BUS2BIT_A_DATA05, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_B2_03_FLEXSPI1_BUS2BIT_A_DATA04, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_B2_06_FLEXSPI1_BUS2BIT_A_DATA07, 0x0AU);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_B2_05_FLEXSPI1_BUS2BIT_A_DATA06, 0x0AU);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_B2_04_FLEXSPI1_BUS2BIT_A_DATA05, 0x0AU);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_B2_03_FLEXSPI1_BUS2BIT_A_DATA04, 0x0AU);
                    break;
                case kFlexspi1_DataB_GPIO_SD_B2_03_00:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_03_FLEXSPI1_BUS2BIT_B_DATA07, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_02_FLEXSPI1_BUS2BIT_B_DATA06, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_01_FLEXSPI1_BUS2BIT_B_DATA05, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_00_FLEXSPI1_BUS2BIT_B_DATA04, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_03_FLEXSPI1_BUS2BIT_B_DATA07, 0x0AU);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_02_FLEXSPI1_BUS2BIT_B_DATA06, 0x0AU);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_01_FLEXSPI1_BUS2BIT_B_DATA05, 0x0AU);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_00_FLEXSPI1_BUS2BIT_B_DATA04, 0x0AU);
                    break;
                case kFlexspi1_DataB_GPIO_B1_09_06:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_B1_06_FLEXSPI1_BUS2BIT_B_DATA07, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_B1_07_FLEXSPI1_BUS2BIT_B_DATA06, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_B1_08_FLEXSPI1_BUS2BIT_B_DATA05, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_B1_09_FLEXSPI1_BUS2BIT_B_DATA04, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_B1_06_FLEXSPI1_BUS2BIT_B_DATA07, 0x0AU);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_B1_07_FLEXSPI1_BUS2BIT_B_DATA06, 0x0AU);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_B1_08_FLEXSPI1_BUS2BIT_B_DATA05, 0x0AU);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_B1_09_FLEXSPI1_BUS2BIT_B_DATA04, 0x0AU);
                    break;
                default:
                    break;
            }
            switch (packet->memConnection.sclk_n)
            {
                case kFlexspi1_SclkB_GPIO_B2_02:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_B2_02_FLEXSPI1_BUS2BIT_B_SCLK, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_B2_02_FLEXSPI1_BUS2BIT_B_SCLK, 0x0AU);
                    break;
                default:
                    break;
            }
            switch (packet->memConnection.dqs1)
            {
                case kFlexspi1_DqsA_GPIO_SD_B2_12:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_12_DUMMY_FLEXSPI1_BUS2BIT_A_DQS, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_12_DUMMY_FLEXSPI1_BUS2BIT_A_DQS, 0x0AU);
                    break;
                case kFlexspi1_DqsB_GPIO_SD_B2_12:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_12_DUMMY_FLEXSPI1_BUS2BIT_B_DQS, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_12_DUMMY_FLEXSPI1_BUS2BIT_B_DQS, 0x0AU);
                    break;
                default:
                    break;
            }
        }
        else if (packet->memConnection.instance == 2)
        {
            switch (packet->memConnection.dataLow4bit)
            {
                case kFlexspi2_DataA_GPIO_EMC_B1_38_35:
                    MTU_USE_MEM_DC_MUX1_FSPI2_PORTA
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_38_FLEXSPI2_BUS2BIT_A_DATA03, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_37_FLEXSPI2_BUS2BIT_A_DATA02, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_36_FLEXSPI2_BUS2BIT_A_DATA01, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_35_FLEXSPI2_BUS2BIT_A_DATA00, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B1_38_FLEXSPI2_BUS2BIT_A_DATA03, 0x0AU);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B1_37_FLEXSPI2_BUS2BIT_A_DATA02, 0x0AU);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B1_36_FLEXSPI2_BUS2BIT_A_DATA01, 0x0AU);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B1_35_FLEXSPI2_BUS2BIT_A_DATA00, 0x0AU);
                    break;
                case kFlexspi2_DataA_GPIO_AON_27_24:
                    MTU_USE_MEM_DC_MUX2_FSPI2_PORTA
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AON_27_FLEXSPI2_BUS2BIT_A_DATA03, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AON_26_FLEXSPI2_BUS2BIT_A_DATA02, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AON_25_FLEXSPI2_BUS2BIT_A_DATA01, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AON_24_FLEXSPI2_BUS2BIT_A_DATA00, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AON_27_FLEXSPI2_BUS2BIT_A_DATA03, 0x0AU);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AON_26_FLEXSPI2_BUS2BIT_A_DATA02, 0x0AU);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AON_25_FLEXSPI2_BUS2BIT_A_DATA01, 0x0AU);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AON_24_FLEXSPI2_BUS2BIT_A_DATA00, 0x0AU);
                    break;
                case kFlexspi2_DataB_GPIO_EMC_B1_33_30:
                    MTU_USE_MEM_DC_MUX1_FSPI2_PORTA
